// Задача 10: Напишите программу, которая принимает на вход
// трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1
/*
int ShowSecondDigit (int number)
{
    number = number / 10;
    number = number % 10;
    return number;
}

Console.Write("Веедите 3-х значное число: ");

int num = Convert.ToInt32(Console.ReadLine());

Console.Write($"Вторая цифра числа {num} = {ShowSecondDigit(num)}");
*/


// Задача 13: Напишите программу, которая выводит третью цифру
// заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6













// Задача 15: Напишите программу, которая принимает на вход цифру,
// обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет