// Задача 25: Напишите цикл, который принимает на вход два числа (A и B)
// и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16
/*
void NumberToThePower(int number, int rank)
{
    int a = number;
    for (int i = 1; i < rank; i++) number = number * a;
    Console.WriteLine($"Число {a} в степени {rank} = {number}");
}

Console.Write("Введи число: ");
int A = Convert.ToInt32(Console.ReadLine());
Console.Write("Введи число: ");
int B = Convert.ToInt32(Console.ReadLine());

NumberToThePower(A, B);
*/

// Задача 27: Напишите программу, которая принимает на вход число и выдаёт
// сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12



// Задача 29: Напишите программу, которая задаёт массив из 8
// элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]
